[
  {
    "title": "Les méthodes « apprendre à chercher » en traitement automatique des langues : un état de l'art",
    "authors": [
      "Elena Knyazeva",
      "Guillaume Wisniewski",
      "François Yvon"
    ],
    "year": 2018,
    "abstract": "L'apprentissage structuré est au fondement des méthodes modernes d'apprentissage automatique pour le traitement automatique des langues (TAL). Dans cet article, nous étudions une famille d'algorithmes d'apprentissage structuré, les algorithmes de la famille « apprendre à chercher », qui diffèrent fondamentalement des méthodes classiques telles que les champs markoviens aléatoires, et permettent donc de mettre en évidence certains des compromis de l'apprentissage structuré en TAL. Nous présentons également un panorama des applications de ces techniques en TAL, en discutant les bénéfices découlant de leur utilisation. ABSTRACT. Structured prediction lies at the heart of modern Natural language Processing (NLP). In this paper, we study a specific family of structured learning algorithms, loosely refered to as \"Learning-to-search\" algorithms. They differ in several important ways from more studied methods such as Conditional Random Fields, and their study highlights several important trade-offs of structured learning for NLP. We also present an overview of existing applications of these techniques to NLP problems and discuss their potential benefits. MOTS-CLÉS : traitement automatique des langues, apprentissage structuré, apprendre à chercher.",
    "uri": "https://hal.science/hal-02103318v1"
  },
  {
    "title": "Intérêt de la spectrométrie de masse MALDI-TOF couplée aux techniques d’apprentissage automatique « machine learning » dans l’identification des agents pathogènes",
    "authors": [
      "Maxime Muller"
    ],
    "year": 2024,
    "abstract": "Ce travail explore l’intégration des méthodes d’apprentissage automatique avec la technologie de spectrométrie de masse MALDI-TOF pour des applications avancées dans le domaine de la microbiologique. Dans une première partie, je me suis concentré sur les aspects fondamentaux de la spectrométrie de masse MALDI-TOF. J’y présente son histoire, ainsi que ses capacités analytiques. La deuxième partie est dédiée aux notions théoriques de l’apprentissage automatique, avec un focus sur les différents types d’algorithmes (supervisés et non supervisés) et les méthodologies de validation. Enfin, la troisième partie s’appuie sur une revue de la littérature scientifique avec pour problématique : Quel est l’apport de l’apprentissage automatique au spectromètre de masse MALDI-TOF dans l’identification des résistances aux antibiotiques ? Pour répondre à cette question, j’ai consulté des études publiées entre 2016 et 2024, et en particulier celles qui portent sur le Staphylococcus aureus résistant à la méticilline, le Staphylococcus aureus résistant à la vancomycine et le Klebsiella pneumoniae résistant aux carbapénèmes. En conclusion, ce travail démontre que l’apprentissage automatique, combiné au MALDI-TOF, constitue une voie prometteuse pour optimiser les capacités d’analyse des spectres de masse.",
    "uri": "https://dumas.ccsd.cnrs.fr/dumas-05003666v1"
  },
  {
    "title": "Évaluation de systèmes apprenant tout au long de la vie",
    "authors": [
      "Yevhenii Prokopalo",
      "Sylvain Meignier",
      "Olivier Galibert",
      "Loïc Barrault",
      "Anthony Larcher"
    ],
    "year": 2020,
    "abstract": "Aujourd’hui les systèmes intelligents obtiennent d’excellentes performances dans de nombreux domaines lorsqu’ils sont entraînés par des experts en apprentissage automatique. Lorsque ces systèmes sont mis en production, leurs performances se dégradent au cours du temps du fait de l’évolution de leur environnement réel. Une adaptation de leur modèle par des experts en apprentissage automatique est possible mais très coûteuse alors que les sociétés utilisant ces systèmes disposent d’experts du domaine qui pourraient accompagner ces systèmes dans un apprentissage tout au long de la vie. Dans cet article nous proposons un cadre d’évaluation générique pour des systèmes apprenant tout au long de la vie (SATLV). Nous proposons d’évaluer l’apprentissage assisté par l’humain (actif ou interactif) et l’apprentissage au cours du temps.",
    "uri": "https://hal.science/hal-02798580v3"
  },
  {
    "title": "L’apprentissage automatique du rangement d’objets et son application à l’évaluation du lustre des perles de culture de Tahiti",
    "authors": [
      "Gaël Mondonneix"
    ],
    "year": 2019,
    "abstract": "Les problèmes d’apprentissage automatique sont parfois résolus avec des méthodes inadaptées, menant à des résultats sous optimaux. La détermination de la méthode à appliquer à la résolution d’un problème d’apprentissage automatique n’est pas toujours aisée, d’un côté parce qu’elle nécessite d’identifier correctement le problème à résoudre, et d’un autre côté parce que même si le problème en question a été identifié correctement, il n’existe pas nécessairement de méthode spécifique pour le résoudre. La présente thèse part du constat selon lequel il n’existe pas d’algorithme d’apprentissage automatique spécifiquement dédié au rangement d’objets (un type particulier de problèmes d’apprentissage ordinal consistant à apprendre un ordre total à partir d’un ensemble de couples d’objets). Une méthode d’apprentissage automatique destinée à combler ce manque est proposée et implémentée sous forme d’une machine à noyau. Un méta-noyau est développé afin de l’adapter aux bibliothèques standard d’apprentissage automatique. L’algorithme proposé est appliqué à un cas concret de problème de rangement d’objets, l’évaluation du lustre des perles de Tahiti, et comparé avec quatre autres méthodes. Cet algorithme donne de meilleurs résultats (93,6% ± 3,9% de prévisions correctes sans sélection de caractéristiques, 94,3% ± 3,4% avec sélection de caractéristiques) que les meilleures des autres méthodes testées (91,3% ± 3,4% et 92,6% ± 4,3% sans et avec sélection de caractéristiques), cette amélioration étant significative (p < 0,01 et p = 0.02 respectivement). En outre, cette méthode ne présente pas de différence significative entre les résultats obtenus avec et sans sélection de caractéristiques (valeur-p = 0.33), ce qui peut indiquer que son biais d'apprentissage correspond bien au problème à résoudre et peut ainsi réduire la charge de travail en phase de prétraitement des données.",
    "uri": "https://upf.hal.science/tel-03180294v1"
  },
  {
    "title": "Structures arborescentes et apprentissage automatique",
    "authors": [
      "Marc Tommasi"
    ],
    "year": 2006,
    "abstract": "Le programme de recherches présenté dans cette synthèse s'inscrit dans la double problématique de l'étude des langages d'arbres et de l'apprentissage automatique à partir de données arborescentes. À la base de ce travail se trouve la question de l'accès et de la manipulation automatique d'informations au format XML au sein d'un réseau d'applications réparties dans internet. La réalisation de ces applications est toujours du ressort de programmeurs spécialistes d'XML et reste hors de portée de l'utilisateur final. De plus, les développements récents d'internet poursuivent l'objectif d'automatiser les communications entre applications s'échangeant des flux de données XML. Le recours à des techniques d'apprentissage automatique est une réponse possible à cette situation. Nous considèrons que les informations sont décrites dans un langage XML, et dans la perspective de ce mémoire, embarquées dans des données structurées sous forme arborescente. Les applications sont basées alors sur des opérations élémentaires que sont l'interrogation ou les requêtes dans ces documents arborescents ou encore la transformation de tels documents. Nous abordons alors la question sous l'angle de la réalisation automatique de programmes d'annotation d'arbres, permettant de dériver des procédures de transformation ou d'exécution de requêtes. Le mémoire décrit les contributions apportées pour la manipulation et l'apprentissage d'ensembles d'arbres d'arité non bornée (comme le sont les arbres XML), et l'annotation par des méthodes de classification supervisée ou d'inférence statistique.",
    "uri": "https://theses.hal.science/tel-00117063v1"
  },
  {
    "title": "Méthodes, techniques et outils d’apprentissage automatique",
    "authors": [
      "Habib Hadj-Mabrouk"
    ],
    "year": 2000,
    "abstract": "Le processus de transfert de connaissances des experts humains vers la machine est complexe et peu étudié. En effet, le goulot d'étranglement du développement d'un système expert ne se limite pas à la seule phase d'extraction de connaissances mais est également lié aux caractéristiques et à la formalisation des connaissances ainsi qu'à la collaboration entre l'expert et le cogniticien. Le savoir-faire des experts repose sur des connaissances subjectives, empiriques et parfois implicites qui peuvent générer plusieurs interprétations. Il n'existe généralement pas d'explication scientifique pour justifier cette expertise compilée. Ces connaissances ne sont pas toujours conscientes chez l'expert, compréhensibles par un novice ou même exprimables par l'intermédiaire d'un langage. La transcription d'un langage verbal (naturel) en langage formel interprétable par une machine provoque souvent une distorsion de la connaissance experte. Ceci introduit un biais entre le modèle cognitif de l'expert et le modèle implémenté. Ce décalage est dû non seulement au fait que les langages de représentation employés en IA ne sont pas d'une richesse suffisante pour expliciter le fonctionnement cognitif de l'expert mais aussi à l'interprétation subjective du cogniticien. Toutes ces contraintes restreignent le champ d'investigation des méthodes d'acquisition de connaissances. L'utilisation des techniques d'apprentissage automatique (Machine Learning) est une solution pour affaiblir ces contraintes. En effet, si la psychologie cognitive et le génie logiciel ont généré des méthodes et outils d'aide à l'acquisition des connaissances, l'exploitation de ces méthodes demeure encore limitée, dans un contexte industriel complexe. Les experts considèrent généralement qu'il est plus simple de décrire des exemples ou des cas expérimentaux plutôt que d'expliciter des processus de prise de décision. L'introduction des systèmes d'apprentissage automatique fonctionnant sur des exemples permet d'engendrer de nouvelles connaissances susceptibles d'aider l'expert à résoudre un problème particulier. L'expertise d'un domaine est non seulement détenue par les experts mais aussi répartie et emmagasinée implicitement dans une masse de données historiques que l'esprit humain éprouve des difficultés à synthétiser. Extraire de cette masse d'informations des connaissances pertinentes dans un but explicatif ou décisionnel constitue l'un des objectifs de l'apprentissage automatique. L'apprentissage automatique (Machine Learning) est une branche importante de la recherche dans le domaine de l'Intelligence Artificielle. L'apprentissage est un terme très général qui décrit le processus selon lequel l'être humain ou la machine peut accroître sa connaissance. Apprendre c'est donc raisonner. Les efforts menés dans ce domaine ont débouché sur une grande variété de méthodes, techniques, algorithmes et systèmes. Ce foisonnement rend difficile la perception du domaine, compte tenu de l'ambiguïté du vocabulaire qui lui est propre et de l'absence de définitions de référence. Sur la base des travaux existants, notre contribution vise à synthétiser les concepts fondamentaux impliqués dans le processus d'apprentissage. Cet article propose donc une caractérisation générale du processus d'apprentissage en précisant ses données d'entrée et de sortie, les contraintes qu'il doit respecter ainsi que les mécanismes employés pour apprendre.",
    "uri": "https://hal.science/hal-03023929v1"
  },
  {
    "title": "Apprentissage des langages réguliers d'arbres à l'aide d'un expert",
    "authors": [
      "Jérôme Besombes",
      "Jean-Yves Marion"
    ],
    "year": 2003,
    "abstract": "Dans le but de modéliser l'apprentissage des langues naturelles, nous nous intéressons à l'apprentissage des langages réguliers d'arbres à partir d'exemples positifs et en interaction avec un expert. L'expert est un oracle qui connaît le langage appris et qui répond à des questions d'appartenance. Nous donnons un algorithme efficace d'apprentissage dans ce paradigme, nous montrons sa correction et l'illustrons sur un exemple détaillé.",
    "uri": "https://inria.hal.science/inria-00099694v1"
  },
  {
    "title": "Apprentissage des grammaires catégorielles à partir de structures",
    "authors": [
      "Jérôme Besombes",
      "Jean-Yves Marion"
    ],
    "year": 2004,
    "abstract": "Nous présentons Alfa, un algorithme d'apprentissage des grammaires catégorielles. Nous nous intéressons à l'apprentissage à la limite à partir d'exemples positifs et les exemples sont des arbres de dérivations partiellement désetiquetés. Nous montrons qu'Alfa identifie la classe des grammaires catérogielles réversibles, une classe contenant strictement les grammaires rigides. En ce sens, ce résultat constitue une extension de l'algorithme de Kanazawa d'apprentissage des grammaires rigides.",
    "uri": "https://inria.hal.science/inria-00100100v1"
  },
  {
    "title": "Apprentissage des langages réguliers d'arbres et applications",
    "authors": [
      "Jérôme Besombes",
      "Jean-Yves Marion"
    ],
    "year": 2003,
    "abstract": "Nous nous intéressons à l'apprentissage des langues naturelles. Notre modèle est l'identification à la limite de Gold et les exemples sont des arbres. La principale contribution est la démonstration du fait que les langages réguliers d'arbres réversibles sont identifiables. Ce résultat nous permet de disposer d'un cadre unifié pour l'apprentissage à partir d'exemples semi-structurés. En particulier, nous présentons trois conséquences de ce résultat. (1) Nous étendons le résultat de Sakakibara concernant l'apprentissage de grammaires algébriques à partir des arbres de dérivation. (2) Nous montrons que les langages d'arbres de dépendances sont identifiables. (3) Nous donnons une nouvelle démonstration de l'apprentissage des grammaires catégorielles de Kanazawa.",
    "uri": "https://inria.hal.science/inria-00099629v1"
  },
  {
    "title": "Optimisation automatique de l'apprentissage en ligne",
    "authors": [
      "Émile Royer"
    ],
    "year": 2024,
    "abstract": "Les méthodes d'optimisation de modèles d'apprentissage automatique en ligne utilisent exclusivement des algorithmes génétiques. Il est raisonnable de penser que des méthodes plus efficaces encore existent en faisant un parallèle avec les autres domaines de l'optimisation. Nous montrons qu'il est possible d'utiliser l'optimisation bayésienne pour l'optimisation en ligne, avec des résultats équivalents à l'état de l'art. Cette nouvelle technique a le potentiel de créer de nouveaux optimiseurs en ligne plus efficaces.",
    "uri": "https://inria.hal.science/hal-04921796v1"
  }
]